/ /*++
// Copyright (c) 2010 Intel Corporation. All rights reserved.
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//
// Module Name: Power.uni
//
// Abstract: Power manager.
// --*/

/=#
#langdef   en-US   "English"
#langdef   zh-Hans "\wide中文\narrow"

#string STR_POWER                       #language en-US   "Power"
                                        #language zh-Hans "\wide电源\narrow"
#string STR_POWER_HELP                  #language en-US   "Power Settings"
                                        #language zh-Hans "\wide电源设置\narrow"

#string STR_AFTER_POWER_LOSS               #language en-US   "After Power Loss"
                                           #language zh-Hans "\wide电源恢复后状态\narrow"
#string STR_AFTER_POWER_LOSS_HELP          #language en-US   "This field controls whether the system will stay on after AC power is removed and then restored.Select "Power On" if you use a power strip to turn the system on.Select "Power Off" if you want the system to remain off after power restored.Select "Last State" to have the system return to the previous state."
                                           #language zh-Hans "\wide这个选项用来控制在电源重新恢复时系统的处于的状态。选择 “开机”在电源恢复时，系统要处于重新开机。选择“关机”在电源恢复时，系统要处于关机状态.选择“上一状态”在电源恢复时，系统要处于之前的状态\narrow"
#string STR_POWER_OFF                      #language en-US   "Power Off"
                                           #language zh-Hans "\wide关机\narrow"
#string STR_POWER_ON                       #language en-US   "Power On"
                                           #language zh-Hans "\wide开机\narrow"
#string STR_POWER_PREVIOUS                 #language en-US   "Last State"
                                           #language zh-Hans "\wide上一个状态\narrow"
#string STR_SLEEP_STATUS                   #language en-US   "ACPI Sleep Status"
                                           #language zh-Hans "ACPI\wide睡眠状态\narrow"
#string STR_SLEEP_STATUS_HELP              #language en-US   "Select ACPI sleep state the system will enter when the SUSPEND button is pressed."
                                           #language zh-Hans "\wide选择在\narrowSUSPEND\wide按钮按下后，系统将会进入的\narrowACPI\wide睡眠状态。\narrow
#string STR_SLEEP_STATUS_DIS               #language en-US   "Disabled"
                                           #language zh-Hans "\wide关闭\narrow
#string STR_SLEEP_STATUS_S1                #language en-US   "S1"
                                           #language zh-Hans "S1"
#string STR_SLEEP_STATUS_S3                #language en-US   "S3"
                                           #language zh-Hans "S3"
#string STR_SLEEP_STATUS_BOTH              #language en-US   "S1 and S3"
                                           #language zh-Hans "S1/wide和/narrowS3"
#string STR_EPSM                           #language en-US   "Enhanced Power Saving Mode(ErP)"
                                           #language zh-Hans "\wide增强的省电模式\narrow"
#string STR_EPSM_HELP                      #language en-US   "[Enabled] The system will enter to Enhanced Power Saving Mode during power off. The total power consumption will be lower during power off. [Disabled] Disables function of Enhanced Power Save Mode. Note: When enabled Enhanced Power Saving Mode, only the Wake Up on Alarm function is supported. Other wake up functions are not supported."
                                           #language zh-Hans "[\wide打开\narrow]\wide系统关机时会进入增强的省电模式。关机状态下，总功耗将会更低。\n\narrow[\wide关闭\narrow] \wide关闭增强的省电模式。\n注意：当打开增强的省电模式，网卡唤醒功能将不能够使用。\narrow  Intel(R) Manageability\wide管理功能将不能够使用。\narrow"
#string STR_AUTO_POWER_ON                  #language en-US   "Automatic Power On"
                                           #language zh-Hans "\wide唤醒配置菜单\narrow"
#string STR_AUTO_POWER_ON_HELP             #language en-US   "Contains automatic power on features."
                                           #language zh-Hans "\narrowAutomatic power on \wide相关功能.\narrow"

#string STR_WAKE_ON_LAN                    #language en-US   "Wake on LAN"
                                           #language zh-Hans "\wide网卡唤醒\narrow"

#string STR_WAKE_ON_LAN_HELP               #language en-US   "Select whether to enable Wake on LAN"
                                           #language zh-Hans "\wide选择是否打开网卡唤醒功能\narrow"
#string STR_PRIMARY                        #language en-US   "Primary"
                                           #language zh-Hans "\wide主要\narrow"
#string STR_AUTOMATIC                      #language en-US   "Automatic"
                                           #language zh-Hans "\wide自动\narrow"
#string STR_WAKE_FROM_PCI_MODEM            #language en-US   "Wake from PCI Modem"
                                           #language zh-Hans "\widePCI调制解调器唤醒\narrow"
#string STR_WAKE_FROM_PCI_MODEM_HELP       #language en-US   "Select whether to enable Wake from PCI modem, and/or which Startup Sequence to use after a PCI modem wake event."
                                           #language zh-Hans "\wide选择是否打开PCI调制解调器唤醒功能并且选择唤醒时采用那种启动顺序.\narrow"
#string STR_WAKE_FROM_SP_RING              #language en-US   "Wake from Serial Port Ring"
                                           #language zh-Hans "\wide串口 Ring唤醒\narrow"
#string STR_WAKE_FROM_SP_RING_HELP         #language en-US   "Select whether to enable Wake from Serial Port Ring, and/or which Startup Sequence to use after a serial port wake event."
                                           #language zh-Hans "\wide选择是否打开串口 Ring唤醒功能并且选择唤醒时采用那种启动顺序.\narrow"
#string STR_WAKE_FROM_PCI_DEVICE           #language en-US   "Wake from PCI Device"
                                           #language zh-Hans "\widePCI设备唤醒\narrow"
#string STR_WAKE_FROM_PCI_DEVICE_HELP      #language en-US   "Select whether to enable Wake from PCI Device, and/or which Startup Sequence to use after a PCI device wake event."
                                           #language zh-Hans "\wide选择是否打开 PCI 设备唤醒功能并且选择唤醒时采用那种启动顺序.\narrow"
#string STR_WAKE_FROM_RTC                  #language en-US   "Wake Up on Alarm"
                                           #language zh-Hans "\wide时钟唤醒\narrow"
#string STR_WAKE_FROM_RTC_HELP             #language en-US   "Select whether to enable Wake Up on Alarm, to turn on your system on a special day of the month, special day of the week or daily. NOTE: Values in these fields may be overwritten by the operating system."
                                           #language zh-Hans "\wide选择是否打开时钟唤醒功能，可以允许您的系统在一个特定的年月日唤醒。注意：设定的值有可能被操作系统覆盖掉。\narrow"
#string STR_SINGLE_EVENT                   #language en-US   "Single Event"
                                           #language zh-Hans "\wide一次\narrow"
#string STR_DAILY_EVENT                    #language en-US   "Daily Event"
                                           #language zh-Hans "\wide每天\narrow"
#string STR_WEEKLY_EVENT                   #language en-US   "Weekly Event"
                                           #language zh-Hans "\wide每周\narrow"
#string STR_USER_DEFINED                   #language en-US   "User Defined"
                                           #language zh-Hans "\wide用户自定义\narrow"
#string STR_PERIOD_MINUTES                   #language en-US   "Period Minutes"
#string STR_PERIOD_SECONDS                   #language en-US   "Period Seconds"
#string STR_STARTUP_SEQUENCE               #language en-US   "  Startup Sequence"
                                           #language zh-Hans "\wide  启动顺序\narrow"
#string STR_STARTUP_SEQUENCE_HELP          #language en-US   "Select the Startup Sequence after a wake up on Alarm event."
                                           #language zh-Hans "\wide选择时钟唤醒时采用那种启动顺序。\narrow"

#string STR_USER_ALARM_TIME_HH             #language en-US   "AlarmTimeHH"
                                           #language zh-Hans   "AlarmTimeHH"
#string STR_USER_ALARM_TIME_MM             #language en-US   "AlarmTimeMM"
                                           #language zh-Hans   "AlarmTimeMM"
#string STR_USER_ALARM_TIME_SS             #language en-US   "AlarmTimeSS"
                                           #language zh-Hans   "AlarmTimeSS"

#string STR_ALARM_DATE                     #language en-US   "  Alarm Date (MM/DD/YYYY)"
                                           #language zh-Hans "\wide  时钟日期(月/日/年)\narrow"
#string STR_ALARM_DATE_HELP                #language en-US "Specify the date when the system is to wake up."
                                           #language zh-Hans "\wide选择唤醒日期\narrow"
#string STR_ALARM_TIME                     #language en-US   "  Alarm Time (HH:MM:SS)"
                                           #language zh-Hans "\wide  时钟时间 (时:分:秒)\narrow"
#string STR_ALARM_TIME_HELP                #language en-US   "Select the Startup Sequence after a wake up on Alarm event."
                                           #language zh-Hans "\wide选择唤醒时间\narrow"
#string STR_USER_ALARM_TIME                     #language en-US   "Alarm Time (HH:MM:SS)"
                                           #language zh-Hans "\wide时钟时间 (时:分:秒)\narrow"

#string STR_ALARM_WEEK_DAY                 #language en-US   "  Alarm Day of Week"
                                           #language zh-Hans "\wide  每周唤醒日期\narrow"
#string STR_ALARM_WEEK_DAY_HELP            #language en-US   "Select the day of the week when the system is to wake up."
                                           #language zh-Hans "\wide选择一周之内的唤醒的日期\narrow"
#string STR_SUNDAY                         #language en-US   "Sunday"
                                           #language zh-Hans "\wide星期日\narrow"
#string STR_MONDAY                         #language en-US   "Monday"
                                           #language zh-Hans "\wide星期一\narrow"
#string STR_TUESDAY                        #language en-US   "Tuesday"
                                           #language zh-Hans "\wide星期二\narrow"
#string STR_WEDNESDAY                      #language en-US   "Wednesday"
                                           #language zh-Hans "\wide星期三\narrow"
#string STR_THURSDAY                       #language en-US   "Thursday"
                                           #language zh-Hans "\wide星期四\narrow"
#string STR_FRIDAY                         #language en-US   "Friday"
                                           #language zh-Hans "\wide星期五\narrow"
#string STR_SATURDAY                       #language en-US   "Saturday"
                                           #language zh-Hans "\wide星期六\narrow"
#string STR_USER_DEF_ALARM                 #language en-US   "User Defined Alarm"
                                           #language zh-Hans "\wide用户自定义唤醒\narrow"
#string STR_USER_DEF_ALARM_WEEKDAY_HELP    #language en-US   "Select the day of the week when the system is to wake up."
                                           #language zh-Hans "\wide选择系统每周唤醒日期\narrow"
#string STR_USER_DEF_ALARM_TIME            #language en-US   "User Defined Alarm Time (HH:MM:SS)"
                                           #language zh-Hans "\wide时钟时间 (时:分:秒)\narrow"
#string STR_USER_DEF_ALARM_TIME_HELP       #language en-US "Specify the time when the system is to wake up."
                                           #language zh-Hans "\wide选择唤醒时间\narrow"
#string STR_RTC_WAKEUP_MINUTE_INCREASE_PROMPT       #language en-US "RTC Wakeup increase(minutes)"
#string STR_TIME_MINUTE_INCREASE_HELP       #language en-US "Set RTC Wakeup increase(minutes) range:1-5"
#string STR_RTC_WAKEUP_SECOND_INCREASE_PROMPT       #language en-US "RTC Wakeup increase(seconds)"
#string STR_TIME_SECOND_INCREASE_HELP       #language en-US "Set RTC Wakeup increase(seconds) range:1-59"
#string STR_EBMC_POWER_CTRL       #language en-US "eBMC Power Control"
#string STR_EBMC_TIMER       #language en-US "eBMC Power Chain Settle Time"

#string STR_LEGACY_SEL_CTRL       #language en-US "Legacy Select Control"
#string STR_KBDC_LEGACY_SEL       #language en-US "KBDC Legacy Select Control"
#string STR_KBDC_LEGACY_SEL_HELP       #language en-US "KBDC Legacy Select Control"
#string STR_INTC_LEGACY_SEL       #language en-US "INTC Legacy Select Control"
#string STR_INTC_LEGACY_SEL_HELP       #language en-US "INTC Legacy Select Control"                                            
#string STR_DMAC_LEGACY_SEL       #language en-US "DMAC Legacy Select Control"
#string STR_DMAC_LEGACY_SEL_HELP       #language en-US "DMAC Legacy Select Control"
#string STR_HARD_MACRO       #language en-US "HardMacro"
#string STR_NEW_DESIGN       #language en-US "New Design"
#string STR_TMRC_LEGACY_SEL       #language en-US "TMRC Legacy Select Control"
#string STR_TMRC_LEGACY_SEL_HELP       #language en-US "TMRC Legacy Select Control"

#string STR_AUTO_POWER_ON       #language en-US "Auto Power On"
#string STR_CX_C4P_CTRL       #language en-US "Chipset Cx State Configuration"
#string STR_CX_LATENCY_CTRL       #language en-US "Cx Latency Control"
#string STR_DYNAMIC_CLK_CTRL       #language en-US "Dynamic Clock Control"
#string STR_OTHER_CTRL       #language en-US "Other Control"
#string STR_POWER_GATING_CTRL       #language en-US "Power Gating Control"
#string STR_OBFF_CTRL       #language en-US "OBFF Control"
#string STR_INTERRUPT_CTRL       #language en-US "Interrupt Control"
#string STR_MSI_SUPPORT       #language en-US "MSI Support"
#string STR_C2       #language en-US "C2"
#string STR_C2C3       #language en-US "C2 C3"
#string STR_C2C3_UPDOWN       #language en-US "C2 C3 Updown mode"
#string STR_C2C4       #language en-US "C2 C4"
#string STR_C2C4_UPDOWN       #language en-US "C2 C4 Updown mode"
#string STR_CONDITIONAL_C4       #language en-US "Conditional C4"
#string STR_CONDITIONAL_C4_HELP       #language en-US "Auto disable C4 if detect specific TV express cards."
#string STR_DISABLED       #language en-US "Disabled"
#string STR_AUTO       #language en-US "Auto"
#string STR_C5_CTRL       #language en-US "CPU Processor C5 Control"
#string STR_C5_CTRL_HELP       #language en-US "Dynamic enable C5 function. If Auto, the BIOS will check the processor whether supports C5; Otherwise, always disable C5 feature."
#string STR_ENABLED       #language en-US "Enabled"
#string STR_C5_DYNAMIC_L2SIZE       #language en-US "C5 Dynamic L2 sizing"
#string STR_C5_DYNAMIC_L2SIZE_HELP       #language en-US "Enable C5 Dynamic L2 sizing"
#string STR_CXINT_CTRL       #language en-US "Cx State Interrupt Filter"
#string STR_CXINT_CTRL_HELP       #language en-US "Enable Cx State interrupt filtering.  If enabled, only destination core wakes up. Else All Cores awake."
#string STR_C4P_CTRL       #language en-US "C4P Control"
#string STR_C4P_CTRL_HELP       #language en-US "Enable C4P Function"
#string STR_BACKC4P_TOC2       #language en-US "Back C4P to C2"
#string STR_BACKC4P_TOC2_HELP       #language en-US "Enable C4P state back to C2 Function"
#string STR_C4P_BUSIDLE_TIMER       #language en-US "C4P BusMaster Idle Timer"
#string STR_C4P_BUSIDLE_TIMER_HELP       #language en-US "Initial Value of the Bus Master Idle Timer;The timer tick is 32KHz"
#string STR_0       #language en-US "0"
#string STR_1       #language en-US "1"
#string STR_2       #language en-US "2"
#string STR_3       #language en-US "3"
#string STR_4       #language en-US "4"
#string STR_5       #language en-US "5"
#string STR_6       #language en-US "6"
#string STR_7       #language en-US "7"

#string STR_C4BUS_TDLE_TIMER       #language en-US "C4 BusMaster Idle Timer(hex)"
#string STR_C4BUS_TDLE_TIMER_HELP       #language en-US "Initial Value of the Bus Master Idle Timer;The timer tick is 0.83us(Using C3/C4 BusMaster idle timers at same time):0 ~ Fh"
#string STR_C3BUS_TDLE_TIMER       #language en-US "C3 BusMaster Idle Timer(hex)"
#string STR_C3BUS_TDLE_TIMER_HELP       #language en-US "Initial Value of the Bus Master Idle Timer;The timer tick is 0.83us(Using C3/C4 BusMaster idle timers at same time):00 ~ FFh"
#string STR_C4_RESUME_TIMER       #language en-US "C4P Resume Timer(hex)"
#string STR_C4_RESUME_TIMER_HELP       #language en-US "Initial Value of Resume timeout(C4H2R_ACK, Using 4KHz clock):00 ~ FFh"
#string STR_CX_STATE_CTRL       #language en-US "Cx state Control"
#string STR_SHORT_C3C4_MODE       #language en-US "Enable Short C3/C4 Mode"
#string STR_SHORT_C3C4_MODE_HELP       #language en-US "Short C3/C4 Mode"
#string STR_DPSLP_TO_SLP       #language en-US "DPSLP# to SLP#"
#string STR_DPSLP_TO_SLP_HELP       #language en-US "DPSLP# deassert to SLP# deassert"
#string STR_00       #language en-US "00"
#string STR_01       #language en-US "01"
#string STR_10       #language en-US "10"
#string STR_11       #language en-US "11"
#string STR_VRDSLP_TO_DPSLP       #language en-US "VRDSLP# to DPSLP#"
#string STR_VRDSLP_TO_DPSLP_HELP       #language en-US "VRDSLP# deassert to DPSLP# deassert"
#string STR_FIXEDDREE_CX_LATENCY       #language en-US "Fixed-Free Cx Latency"
#string STR_FIXEDDREE_CX_LATENCY_HELP       #language en-US "Using original latency items or Cx latency row3/4 settings and hiding original latency items"
#string STR_FIXED       #language en-US "Fixed"
#string STR_FREE       #language en-US "Free"
#string STR_FIXED_FREE       #language en-US "Free With Slow Mode"
#string STR_DYNAMIC_T05       #language en-US "Dynamic T05"
#string STR_DYNAMIC_T05_HELP       #language en-US "Dynamic T05"
#string STR_SB_DYNAMIC_CLK_CTRL       #language en-US "SB Dynamic Clock Control"
#string STR_SB_DYNAMIC_CLK_CTRL_HELP       #language en-US "SB Dynamic Clock Control"
#string STR_TMRC_DYNAMIC_CLK_CTRL       #language en-US "TMRC Dynamic Clock Control"
#string STR_TMRC_DYNAMIC_CLK_CTRL_HELP       #language en-US "TMRC Dynamic Clock Control"
#string STR_EHCI_SLEEP_TIME       #language en-US "EHCI Sleep Time"
#string STR_EHCI_SLEEP_TIME_HELP       #language en-US "EHCI Sleep Time"
#string STR_CCABURST_ACCESS       #language en-US "CCA Burst Access"
#string STR_CCABURST_ACCESS_HELP       #language en-US "CCA Burst Access"
#string STR_MOBILE_CENTER_CTRL       #language en-US "Mobile Center Control"
#string STR_MOBILE_CENTER_CTRL_HELP       #language en-US "Mobile Center Control"
#string STR_ACA_ADAPTER_CTRL       #language en-US "AC Adapter Control"
#string STR_ACA_ADAPTER_CTRL_HELP       #language en-US "AC Adapter Control"
#string STR_ACLOSS_AUTO_RESTART       #language en-US "AC Loss Auto-restart"
#string STR_ACLOSS_AUTO_RESTART_HELP       #language en-US "AC Loss Auto-restart"
#string STR_LAST_STATE       #language en-US "Last State"
#string STR_PLLOK_SEL_CTRL       #language en-US "PLLOK Selection Control "
#string STR_PLLOK_SEL_CTRL_HELP       #language en-US "PLLOK Selection Control "
#string STR_LOGIC       #language en-US " Logic Control"
#string STR_CIRCUIT       #language en-US "Circuit Control"
#string STR_USB_S4_WAKEUP       #language en-US "USB S4 WakeUp"
#string STR_USB_S4_WAKEUP_HELP       #language en-US "USB S4 WakeUp"
#string STR_CPU_FAN_CTRL       #language en-US "CPU Fan Control"
#string STR_CPU_FAN_CTRL_HELP       #language en-US "CPU Fan Control"
#string STR_AUTO_CTRL       #language en-US "Auto Control"
#string STR_ALWAYS_ON       #language en-US "Always On"

#string STR_S3_RESUME_VIDEO_REPOST       #language en-US "Repost Video on S3 Resume"
#string STR_S3_RESUME_VIDEO_REPOST_HELP       #language en-US "Determines whether to invoke VGA BIOS post on S3/STR resume.This item should be open when customer uses the Linux OS."
#string STR_NO       #language en-US "No"
#string STR_YES       #language en-US "Yes"


#string STR_ISO_EUX           #language en-US "SOEUX Power Control"

#string STR_SAPD1_TIMER       #language en-US "SAPD1 Power Chain Settle Time"
#string STR_SAPD2_TIMER       #language en-US "SAPD2 Power Chain Settle Time"
#string STR_RANGE_0_31       #language en-US "Range: 0~31 (00h~1Fh)"



#string STR_EMPTY       #language en-US " "
#string STR_ISO_TUF       #language en-US "SOTUF Power Control"
#string STR_ISO_BMU       #language en-US "BMU Power Control"
#string STR_ISO_VPP       #language en-US "VPP Power Control"
#string STR_ISO_DIU       #language en-US "DIU Power Control"
#string STR_ISO_SAPD1       #language en-US "SAPD1 Power Control"
#string STR_ISO_SAPD2       #language en-US "SAPD2 Power Control"
#string STR_ISO_XHCI       #language en-US "XHCI Power Control"
#string STR_XHCI_TIMER       #language en-US "XHCI Power Chain Settle Time"
#string STR_PCIE_OBFF_CTRL       #language en-US "PCIE OBFF Control in SB"
#string STR_PCIE_OBFF_PATH       #language en-US "PCIE OBFF Delivery Path"
#string STR_PEX_WAKE       #language en-US "PEXWAKE#"
#string STR_MESSAGE       #language en-US "Message"
